Revit 2027 API
Element.Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace